{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "BAAI/bge-multilingual-gemma2",
  "bias": "none",
  "inference_mode": false,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "gate_proj",
    "v_proj",
    "q_proj",
    "o_proj",
    "k_proj",
    "up_proj",
    "down_proj"
  ],
  "task_type": "FEATURE_EXTRACTION",
  "use_dora": false,
  "use_rslora": false
}
